khoint5304/Snake_game_on_stm32/Snake/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

  /* Private includes ----------------------------------------------------------*/
  /* USER CODE BEGIN Includes */

  /* USER CODE END Includes */

  /* Exported types ------------------------------------------------------------*/
  /* USER CODE BEGIN ET */

  /* USER CODE END ET */

  /* Exported constants --------------------------------------------------------*/
  /* USER CODE BEGIN EC */

  /* USER CODE END EC */

  /* Exported macro ------------------------------------------------------------*/
  /* USER CODE BEGIN EM */

  /* USER CODE END EM */

  /* Exported functions prototypes ---------------------------------------------*/
  void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define VSYNC_FREQ_Pin GPIO_PIN_2
#define VSYNC_FREQ_GPIO_Port GPIOE
#define RENDER_TIME_Pin GPIO_PIN_3
#define RENDER_TIME_GPIO_Port GPIOE
#define FRAME_RATE_Pin GPIO_PIN_4
#define FRAME_RATE_GPIO_Port GPIOE
#define MCU_ACTIVE_Pin GPIO_PIN_5
#define MCU_ACTIVE_GPIO_Port GPIOE
#define SPI5_NCS_Pin GPIO_PIN_1
#define SPI5_NCS_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* Snake Game Button Definitions */
/* Using PD4, PD5, PD6, PD7 for UP, DOWN, LEFT, RIGHT buttons */
/* These pins are free and available on STM32F429I-DISCO header */
#define BTN_UP_Pin GPIO_PIN_4
#define BTN_UP_GPIO_Port GPIOD
#define BTN_DOWN_Pin GPIO_PIN_5
#define BTN_DOWN_GPIO_Port GPIOD
#define BTN_LEFT_Pin GPIO_PIN_6
#define BTN_LEFT_GPIO_Port GPIOD
#define BTN_RIGHT_Pin GPIO_PIN_7
#define BTN_RIGHT_GPIO_Port GPIOD

/* ISD1820 Audio Module Definitions */
/* Using PD12 for ISD1820 PLAY-L control (active LOW pulse to play) */
/* Note: PE9/PE10 are used for FMC SDRAM, so we use PD12/PD13 instead */
#define ISD1820_PLAY_Pin GPIO_PIN_12
#define ISD1820_PLAY_GPIO_Port GPIOD
  /* PD13 is reserved but not needed for basic playback - only PLAY-L is required */

  /* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
